{"title":"Настанак Трајекторије","description":"О самом пројекту, одабраном имену и потреби за писањем","html":"\n<p>Веома ми је драго ми је да си овде и да читаш мој блог.</p>\n<p>\n  Овај пројекат покрећем зато што ми је потребан простор да бележим ствари које радим, а које бих волео да остану записане и уредно спаковане на једном месту. \n  Ово ће за пар година бити само успомена на старе дане и ништа се неће разликовати од оних које стоје у соби по фиокама.  \n</p>\n<p>\n  С обзиром на то да ми је тек за пар дана пуне 3 године откако радим као Јаваскрипт програмер, нисам потпуно сигуран да ли је прерано. Касно сигурно није, јер за \n  све ово време, ако рачунамо и оних 4 студија, све могуће идеје које су ми се вртеле по глави, које сам потом правио и мислио да би некоме биле корисне су лепо упале \n  у поточић и лагано отплутале. Као што сам ово написао тако олако, али и не баш превише еколошки коректно, тако нисам био ни потпуно спреман да се од свих опростим. \n  Оставио сам неколико њих на Гиту, како у приватном, тако и у јавном приступу, чисто за случај да имам подсетник за неколико година ако их будем оживљавао.\n</p>\n\n<p>А зашто Трајекторија?</p>\n\n<p>\n  Ако ћемо по дефиницији из основне школе: то је линија по којој се тело креће. Тако сам и ја замислио да представим тело (дакле себе) и путању (трајекторију) по којој се крећем. \n</p>\n\n<p>\n  То ми некако највише има смисла, поготово због тога што је мој циљ да пишем на чему и како радим, евентуално да дам коментар на одређене догађаје које бих волео да остану забележени\n  и који се мени чине занимљивим. Из тог разлога се неће многима свидети мој начин писања и неће увек свако ни разумети шта сам хтео да кажем.\n</p>\n\n<p>Надам се да ће ти се свидети целокупан садржај.</p>\n","image":"images/t.png","slug":"nastanak-trajektorije","categories":[{"id":"trajektorija","label":"Трајекторија"}],"date":1617742975109,"metadata":{"title":"Настанак Трајекторије","description":"О самом пројекту, одабраном имену и потреби за писањем","keywords":"Трајекторија","url":"https://trajektorija.com/nastanak-trajektorije","thumb":"https://trajektorija.com/logo_large.png","thumbAlt":"Слика чланка"}}