export default `
<p>
Откако сам направио још први пројекат у локалу, увек ме је интересовало како да своју апликацију поставим на прави домен тако да буде видљива за све.
У почетку, док сам радио на својим малим пројектима, то су углавном били бесплатни домени који ти накаче рандом име домена и ограниче приступ - активно 8 сати дневно, па ти одабери време када желиш да буде видљиво. 
</p>

<p>
У то време, тачније око 2014, Пехапе је и даље био популаран. Скоро сваки хостинг тада је пружао услугу да се Пехапе постави или бесплатно, или да се плати 5 долара. 
Ретко који хостинг је могао да обезбеди да се постави апликација базирана на Ноду. Код оних који су то могли тај пакет је био доста скупљи, спадао је у премијум и био негде око 35 долара месечно. 
</p>

<p>
Оно што је тада било супер је то да је Гитхаб тада студентима давао много других лепих погодности, између осталог по један бесплатан домен и годину дана бесплатног хостинга. 
Били су добро увезани са платформама, као на пример Хироку, где сам коначно могао да поставим своју Нод апликацију, па макар и са рандом именом домена. 
Мислим и да је то била та тачка на којој сам превагнуо са Пехапеа на Јаваскрипт и још тада направио своју прву хостовану апликацију помоћу Риекта.
</p>

<p>
На сву срећу нисам стекао одбојност према томе, али сам осећао велику рупу у знању и имао сам још већу жељу да схватим како да сам своје сервере конфигуришем. 
</p>

<p>
Прво искуство са Енџин иксом сам имао на послу када сам само добио Линукс машину и задатак да ту поставим свој пројекат који сам направио. Увек сам више волео да радим преко конзоле него преко графичких
интерфејса па ми није тешко пало да брљам по серверу, да гледам по документацији и осталим конфигурационим фајловима који су се ту налазили. Осећао сам се јако поносно иако је адреса у прегледачу
приказивала име машине и број порта.
</p>

<p>
После много, на сличан начин, постављених пројеката осећао сам потребу да то поново направим, са правим доменом и на својој машини. Због мени битних разлога, између осталог оног најбитнијег - приватности, 
никада нисам волео да своје податке остављам по сајтовима који ће чувати тек тако, а ја да не бринем. Код таквих сам се пуно пута опекао и видео да то није место за мене. Требао ми је велики простор где ћу моћи да
складиштим све своје и битне и небитне белешке и да будем сигуран да само ја имам приступ бази.
</p>

<p>
Рад са поддоменима ми је тада још увек био непознат и нисам имао контролу над својим доменом него сам комуницирао са пружаоцем услуга искључиво мејлом.
Да бих спречио често писање мејлова и чекање на одговор, лакше решење је било да над једим доменом направим поддиректоријуме и конфигуришем да над сваком апликацијом коју убацим стоји одређена рута.
Нисам ни знао да ће ми тако једноставна и чиста структура донети тако један од најзанимљивијих пројеката којим сам се икада играо. 
Осим што сам добио структуру какву сам хтео, морао сам и да направим мали систем који ће ми вршити контролу приступа. Сјајан начин да се стварно спозна вредност колачића које сам тада делио између скроз 
различитих апликација. 
</p>

<p>
И где на крају можемо да ставимо црту, кажемо да је наш део завршен и одредимо границу до које бисмо требали да идемо? 
Ако је то када завршимо апликацију онда би то било преуско, јер се све своди на одређени број задатака које ћемо кад-тад завршити. 
Ако одлучимо да одемо само мало даље онда треба да будемо спремни да се упустимо у нове авантуре и бавимо се оним делом прегледача у који уписујемо адресу, 
уместо да то баталимо онда када унутра напишемо <span class="code">localhost</span>.
</p>

<p>
Нема вишка од ког ће главица да боли, рекоше давно преци наши.
</p>
`;