export default `
<p>
  Како је чудно да живимо спокојно знајући да нам је сваки корак убележен,
  да нам је лепши виртуелни од правог света и да не покушавамо да имамо приватност.
</p>

<p>
  Признајем да завидим онима који успевају да је сачувају, онима који су више свесни и који не дозвољавају да буду коришћени.
  И захвалан сам им јер покушавају да допру до нас и личним примером покажу да је могуће живети потпуно самостално.
</p>

<p>
  На крају нас убедише да је сасвим нормално немати приватност, јер ми упорно не желимо да се освестимо 
  и схватимо да та два начина бесплатног давања, оно које они нама дају и оно које ми њима дајемо, уопште не могу да се поистовете.
</p>

<p>
  Зар није чудна ова стварност пред којом жмуримо, 
  што смо властити живот препустили и што нам уопште није на листи приоритета да га повратимо?
</p>
`;